&Заполнено
Перем Поле1 Экспорт;

&Заполнено
Перем Поле2 Экспорт;

&Минимум(-10)
&Максимум(10)
Перем Поле3 Экспорт;

&Тип("Строка")
Перем Поле4 Экспорт;

&Кратно(2)
Перем Поле5 Экспорт;

&ОдинИз("first", "second")
Перем Поле6 Экспорт;

&Размер(Минимум = 2, Максимум = 5)
Перем Поле7 Экспорт;

&Шаблон("^[A-Z]+$")
Перем Поле8 Экспорт;

&Формат("email")
Перем Поле9 Экспорт;

&Валидно
Перем ВложенныйОбъект Экспорт;

&Валидно
Функция ВернутьСебя() Экспорт
	Возврат ЭтотОбъект;
КонецФункции

Функция ПроверитьВходящиеПараметры(&Валидно Параметр1, &Валидно Параметр2) Экспорт

КонецФункции

&Желудь
&Характер("Компанейский")
Процедура ПриСозданииОбъекта()
КонецПроцедуры
