Процедура ПриИнициализацииПоделки(Поделка) Экспорт
	
	Поделка.ДобавитьАннотацию(Тип("АннотацияВалидно"));
	Поделка.ДобавитьАннотацию(Тип("АннотацияЗаполнено"));
	Поделка.ДобавитьАннотацию(Тип("АннотацияИстина"));
	Поделка.ДобавитьАннотацию(Тип("АннотацияЛожь"));
	Поделка.ДобавитьАннотацию(Тип("АннотацияМаксимум"));
	Поделка.ДобавитьАннотацию(Тип("АннотацияМинимум"));
	
	Поделка.ДобавитьАннотацию(Тип("АннотацияВалидация"));
	Поделка.ДобавитьДуб(Тип("ДубСВалидациями"));
	Поделка.ДобавитьЖелудь(Тип("ОсенняяФабрикаВалидаций"));
	Поделка.ДобавитьНапильник(Тип("ОбработкаНапильникомАннотацииВалидно"));
	
КонецПроцедуры

&Заготовка
Процедура ПриСозданииОбъекта()
КонецПроцедуры
