#Использовать validate

&Завязь
&Валидация("Валидно")
Функция ВалидацияОграниченияВалидно(&Пластилин Валидатор, &Блестяшка Ограничение) Экспорт
	Валидация = Новый ВалидацияОграниченияВалидно();
	Валидация.УстановитьВалидатор(Валидатор);
	Валидация.Инициализировать(Ограничение);
	
	Возврат Валидация;
КонецФункции

&Завязь
&Валидация("Заполнено")
Функция ВалидацияОграниченияЗаполнено(&Блестяшка Ограничение) Экспорт
	Валидация = Новый ВалидацияОграниченияЗаполнено();
	Валидация.Инициализировать(Ограничение);
	
	Возврат Валидация;
КонецФункции

&Завязь
&Валидация("Истина")
Функция ВалидацияОграниченияИстина(&Блестяшка Ограничение) Экспорт
	Валидация = Новый ВалидацияОграниченияИстина();
	Валидация.Инициализировать(Ограничение);
	
	Возврат Валидация;
КонецФункции

&Завязь
&Валидация("Ложь")
Функция ВалидацияОграниченияЛожь(&Блестяшка Ограничение) Экспорт
	Валидация = Новый ВалидацияОграниченияЛожь();
	Валидация.Инициализировать(Ограничение);
	
	Возврат Валидация;
КонецФункции

&Завязь
&Валидация("Максимум")
Функция ВалидацияОграниченияМаксимум(&Блестяшка Ограничение) Экспорт
	Валидация = Новый ВалидацияОграниченияМаксимум();
	Валидация.Инициализировать(Ограничение);
	
	Возврат Валидация;
КонецФункции

&Завязь
&Валидация("Минимум")
Функция ВалидацияОграниченияМинимум(&Блестяшка Ограничение) Экспорт
	Валидация = Новый ВалидацияОграниченияМинимум();
	Валидация.Инициализировать(Ограничение);

	Возврат Валидация;
КонецФункции

&Завязь
&Валидация("Кратно")
Функция ВалидацияОграниченияКратно(&Блестяшка Ограничение) Экспорт
	Валидация = Новый ВалидацияОграниченияКратно();
	Валидация.Инициализировать(Ограничение);

	Возврат Валидация;
КонецФункции

&Завязь
&Валидация("ОдинИз")
Функция ВалидацияОграниченияОдинИз(&Блестяшка Ограничение) Экспорт
	Валидация = Новый ВалидацияОграниченияОдинИз();
	Валидация.Инициализировать(Ограничение);

	Возврат Валидация;
КонецФункции

&Завязь
&Валидация("Размер")
Функция ВалидацияОграниченияРазмер(&Блестяшка Ограничение) Экспорт
	Валидация = Новый ВалидацияОграниченияРазмер();
	Валидация.Инициализировать(Ограничение);

	Возврат Валидация;
КонецФункции

&Завязь
&Валидация("Формат")
Функция ВалидацияОграниченияФормат(&Блестяшка Ограничение) Экспорт
	Валидация = Новый ВалидацияОграниченияФормат();
	Валидация.Инициализировать(Ограничение);

	Возврат Валидация;
КонецФункции

&Завязь
&Валидация("Шаблон")
Функция ВалидацияОграниченияШаблон(&Блестяшка Ограничение) Экспорт
	Валидация = Новый ВалидацияОграниченияШаблон();
	Валидация.Инициализировать(Ограничение);

	Возврат Валидация;
КонецФункции

&Завязь
&Валидация("Тип")
Функция ВалидацияОграниченияТип(&Блестяшка Ограничение) Экспорт
	Валидация = Новый ВалидацияОграниченияТип();
	Валидация.Инициализировать(Ограничение);

	Возврат Валидация;
КонецФункции

&Завязь
Функция Валидатор(&Пластилин ФабрикаВалидаций, &Пластилин КонтейнерАннотаций) Экспорт
	Возврат Новый Валидатор(ФабрикаВалидаций, КонтейнерАннотаций);
КонецФункции

&Дуб
Процедура ПриСозданииОбъекта()
КонецПроцедуры
